# Pandas

Case Study: Library Data Analysis

You are given a library database with three CSV files:

Books dataset – details of books available in the library.

Members dataset – details of library members.

Transactions dataset – record of borrowing and returning books.

Perform the following tasks using Pandas:

In [40]:
import pandas as pd

df1 = pd.read_csv("C:\\Users\\ashish\\Downloads\\books.csv")
df2 = pd.read_csv("C:\\Users\\ashish\\Downloads\\members.csv")
df3 = pd.read_csv("C:\\Users\\ashish\\Downloads\\transactions.csv")
df1.head()
df2.head()
df3.head()

   TransactionID  MemberID  BookID  BorrowDate  ReturnDate
0           1001       101       1  2023-08-01  2023-08-15
1           1002       102       3  2023-08-05  2023-08-20
2           1003       101       2  2023-09-01  2023-09-10
3           1004       103       5  2023-09-02         NaN
4           1005       104       4  2023-09-03  2023-09-12

Part A: Data Loading & Inspection

Load all three CSV files into Pandas DataFrames.

Display the first 5 and last 5 rows of each dataset.

Print the number of rows and columns, and check datatypes.

Generate summary statistics for numerical columns.

In [41]:
print(df1.head())      
print(df1.tail())      
print(df2.shape)        
print(df2.info())       
print(df3.describe())

   BookID                  Title               Author      Genre  Year
0       1  To Kill a Mockingbird           Harper Lee    Fiction  1960
1       2                   1984        George Orwell  Dystopian  1949
2       3    Pride and Prejudice          Jane Austen    Romance  1813
3       4       The Great Gatsby  F. Scott Fitzgerald    Fiction  1925
4       5             The Hobbit       J.R.R. Tolkien    Fantasy  1937
   BookID                  Title               Author      Genre  Year
0       1  To Kill a Mockingbird           Harper Lee    Fiction  1960
1       2                   1984        George Orwell  Dystopian  1949
2       3    Pride and Prejudice          Jane Austen    Romance  1813
3       4       The Great Gatsby  F. Scott Fitzgerald    Fiction  1925
4       5             The Hobbit       J.R.R. Tolkien    Fantasy  1937
(5, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   MemberID        5 non-null      int64
 1   Name            5 non-null      object
 2   Age             5 non-null      int64
 3   MembershipDate  5 non-null      object
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes
None
       TransactionID   MemberID    BookID
count       5.000000    5.00000  5.000000
mean     1003.000000  102.20000  3.000000
std         1.581139    1.30384  1.581139
min      1001.000000  101.00000  1.000000
25%      1002.000000  101.00000  2.000000
50%      1003.000000  102.00000  3.000000
75%      1004.000000  103.00000  4.000000
max      1005.000000  104.00000  5.000000

Part B: Data Cleaning

Handle missing values:

Replace missing Fine values with 0.

If Return_Date is missing, assume the book is still borrowed.

Remove duplicate rows, if any.

Rename column Copies_Available to Available.

Part C: Selection & Filtering

Display only Title, Author, Genre of books.

Find all books belonging to "Science Fiction" genre.

List members below the age of 18.

Identify all transactions where books are not yet returned.

In [42]:
df3['Fine'] = [0, 5, 0, None, 2]  
df1['Copies_Available'] = [3, 2, 5, 1, 4]  

df3['Fine'] = df3['Fine'].fillna(0)
display(df3.tail())

   TransactionID  MemberID  BookID  BorrowDate  ReturnDate  Fine
0           1001       101       1  2023-08-01  2023-08-15   0.0
1           1002       102       3  2023-08-05  2023-08-20   5.0
2           1003       101       2  2023-09-01  2023-09-10   0.0
3           1004       103       5  2023-09-02         NaN   0.0
4           1005       104       4  2023-09-03  2023-09-12   2.0

In [43]:
df1 = df1.drop_duplicates()
df2 = df2.drop_duplicates()
df3 = df3.drop_duplicates()

In [44]:
df1.rename(columns={'Copies_Available': 'Available'}, inplace=True)
df1

,BookID,Title,Author,Genre,Year,Available
0,1,To Kill a Mockingbird,Harper Lee,Fiction,1960,3
1,2,1984,George Orwell,Dystopian,1949,2
2,3,Pride and Prejudice,Jane Austen,Romance,1813,5
3,4,The Great Gatsby,F. Scott Fitzgerald,Fiction,1925,1
4,5,The Hobbit,J.R.R. Tolkien,Fantasy,1937,4

In [45]:
df1, df2,df3

(   BookID                  Title               Author      Genre  Year  \
 0       1  To Kill a Mockingbird           Harper Lee    Fiction  1960
 1       2                   1984        George Orwell  Dystopian  1949
 2       3    Pride and Prejudice          Jane Austen    Romance  1813
 3       4       The Great Gatsby  F. Scott Fitzgerald    Fiction  1925
 4       5             The Hobbit       J.R.R. Tolkien    Fantasy  1937

    Available
 0          3
 1          2
 2          5
 3          1
 4          4  ,
    MemberID           Name  Age MembershipDate
 0       101  Alice Johnson   25     2021-06-15
 1       102      Bob Smith   32     2020-08-22
 2       103  Charlie Brown   19     2022-01-10
 3       104   Diana Prince   28     2019-11-05
 4       105  Edward Norton   35     2021-03-30,
    TransactionID  MemberID  BookID  BorrowDate  ReturnDate  Fine
 0           1001       101       1  2023-08-01  2023-08-15   0.0
 1           1002       102       3  2023-08-05  2023-08-20   5.0
 2           1003       101       2  2023-09-01  2023-09-10   0.0
 3           1004       103       5  2023-09-02         NaN   0.0
 4           1005       104       4  2023-09-03  2023-09-12   2.0)

In [46]:
df1[["Title", "Author", "Genre"]]

                   Title               Author      Genre
0  To Kill a Mockingbird           Harper Lee    Fiction
1                   1984        George Orwell  Dystopian
2    Pride and Prejudice          Jane Austen    Romance
3       The Great Gatsby  F. Scott Fitzgerald    Fiction
4             The Hobbit       J.R.R. Tolkien    Fantasy

In [47]:
df1[df1["Genre"] == "Fiction"]

,BookID,Title,Author,Genre,Year,Available
0,1,To Kill a Mockingbird,Harper Lee,Fiction,1960,3
3,4,The Great Gatsby,F. Scott Fitzgerald,Fiction,1925,1

In [52]:
df2[df2['Age'] < 30]

   MemberID           Name  Age MembershipDate
0       101  Alice Johnson   25     2021-06-15
2       103  Charlie Brown   19     2022-01-10
3       104   Diana Prince   28     2019-11-05

Part D: Sorting & Aggregation

Sort all books by Published_Year in descending order.

Find total available copies per Genre.

Count how many books each member has borrowed.

Find the top 5 members who paid the highest total fine.

In [53]:
books_sorted = df1.sort_values(by='Year', ascending=False)
books_sorted.head()

,BookID,Title,Author,Genre,Year,Available
0,1,To Kill a Mockingbird,Harper Lee,Fiction,1960,3
1,2,1984,George Orwell,Dystopian,1949,2
4,5,The Hobbit,J.R.R. Tolkien,Fantasy,1937,4
3,4,The Great Gatsby,F. Scott Fitzgerald,Fiction,1925,1
2,3,Pride and Prejudice,Jane Austen,Romance,1813,5

In [54]:
copies_per_genre = df1.groupby('Genre')['Available'].sum().reset_index()
copies_per_genre

       Genre  Available
0  Dystopian          2
1    Fantasy          4
2    Fiction          4
3    Romance          5

In [56]:
books_borrowed = df3.groupby('MemberID')['BookID'].count().reset_index()
books_borrowed.rename(columns={'BookID': 'BooksBorrowed'}, inplace=True)
books_borrowed

   MemberID  BooksBorrowed
0       101              2
1       102              1
2       103              1
3       104              1

In [60]:
top_fines = df3.groupby('MemberID')['Fine'].sum().reset_index()
top_fines = top_fines.sort_values(by='Fine', ascending=False).head(5)
top_fines

   MemberID  Fine
1       102   5.0
3       104   2.0
0       101   0.0
2       103   0.0

In [61]:
books_sorted, copies_per_genre, books_borrowed, top_fines

(   BookID                  Title               Author      Genre  Year  \
 0       1  To Kill a Mockingbird           Harper Lee    Fiction  1960
 1       2                   1984        George Orwell  Dystopian  1949
 4       5             The Hobbit       J.R.R. Tolkien    Fantasy  1937
 3       4       The Great Gatsby  F. Scott Fitzgerald    Fiction  1925
 2       3    Pride and Prejudice          Jane Austen    Romance  1813

    Available
 0          3
 1          2
 4          4
 3          1
 2          5  ,
        Genre  Available
 0  Dystopian          2
 1    Fantasy          4
 2    Fiction          4
 3    Romance          5,
    MemberID  BooksBorrowed
 0       101              2
 1       102              1
 2       103              1
 3       104              1,
    MemberID  Fine
 1       102   5.0
 3       104   2.0
 0       101   0.0
 2       103   0.0)